"""测试数据的保存。

接口自动化自动化测试放在 Excel 当中，
web 自动化测试数据：1， py 文件当中，  2， Excel 当中

数据分组：把不同的测试用例方法需要用到的数据放入不同的组
分组的依据：是因为测试步骤不一样。

# 通过表单
# 2，接口当中也是有数据分组，不同的表单当中，

"""

login_data_error = [
    {"mobile": "", "pwd": "", "expected": "请输入手机号"},
    {"mobile": "", "pwd": "123456Aa", "expected": "请输入手机号"},
    {"mobile": "1338528960", "pwd": "123456Aa", "expected": "请输入有效的手机号"},
    {"mobile": "133852896000", "pwd": "123456Aa", "expected": "请输入有效的手机号"},

]

login_data_num_error = [
    {"mobile": "13385289600", "pwd": "", "expected": "请输入密码"},
    {"mobile": "13385289600", "pwd": "123456A", "expected": "密码最少8位"}
]

login_data_invalid = [
    {"mobile": "13385289601", "pwd": "123456Aa", "expected": "账号或密码错误"},
    {"mobile": "13385289600", "pwd": "123456666", "expected": "账号或密码错误"}
]


login_data_success = [
    {"mobile": "13385289600", "pwd": "123456Aa", "expected": "选择账号进入首页"}
]

# >>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>>
